In [1]:
# import libraries
import pandas as pd
import numpy as np
from pymysql import connect
from faker import Faker
from datetime import date
from sqlalchemy import create_engine
import warnings

In [2]:
# initializing the faker library
fake=Faker()

In [3]:
# defining number of rows
users=500
transactions=10000

In [4]:
# creating the user table
np.random.seed(42)
fake.seed_instance(42)
user=pd.DataFrame({"user_id":np.arange(1,users+1),
                  "first_name":[fake.first_name() for _ in range(users)],
                  "last_name":[fake.last_name() for _ in range(users)],
                  "email":[fake.email() for _ in range(users)],
                  "phone_number":[fake.numerify("+44 #### ### ###") for _ in range(users)],
                  "age":np.random.randint(18,65, users)})
user

,user_id,first_name,last_name,email,phone_number,age
0,1,Danielle,Dean,pollardmichael@example.net,+44 6578 759 856,56
1,2,Angel,Johnson,bruce43@example.org,+44 4205 930 407,46
2,3,Joshua,Long,ndavis@example.net,+44 8593 213 348,32
3,4,Jeffrey,Elliott,williamsmatthew@example.org,+44 0396 522 395,60
4,5,Jill,Johnson,caseyhubbard@example.org,+44 5905 992 937,25
...,...,...,...,...,...,...
495,496,Erin,Johnson,rebekahhill@example.com,+44 5452 280 156,37
496,497,Richard,Wood,austinharvey@example.org,+44 1931 837 455,41
497,498,Frederick,Ramos,victor87@example.org,+44 0842 891 077,29
498,499,Tanner,Sampson,ramirezderrick@example.org,+44 1199 180 812,52
499,500,David,Foley,crystalpham@example.org,+44 1352 478 712,50

In [5]:
warnings.filterwarnings('ignore')
user['email'][0]='_pollard_michael_example.net'
user['email'][24]='stephanie71example.org'
user['email'][276]='jfaulkner-@example.net'
user['email'][29]='caroline51#@example.net'
user['email'][55]='.christopher13@example.com'
user['email'][98]='mariah.davis@example.org.'
user['email'][113]='myerstheodore@example_net'
user['email'][167]='5barkereric@example.com'

In [6]:
# checking for null values in user table
user.isnull().sum()

user_id         0
first_name      0
last_name       0
email           0
phone_number    0
age             0
dtype: int64

In [7]:
# checking for datatypes
user.dtypes

user_id          int32
first_name      object
last_name       object
email           object
phone_number    object
age              int32
dtype: object

In [8]:
# checking for duplicates
user[user.duplicated]

Empty DataFrame
Columns: [user_id, first_name, last_name, email, phone_number, age]
Index: []

In [9]:
# creating the account table
account_num=800
np.random.seed(22)
fake.seed_instance(22)
account=pd.DataFrame({"account_id":np.arange(1,account_num+1),
                     "user_id":np.random.choice(user['user_id'],account_num),
                     "account_balance":np.round(np.random.uniform(500,1000, account_num),2),
                     "account_type":np.random.choice(['checking','savings','loan'], account_num),
                     "signup_date":[fake.date_between(start_date='-2y', end_date='-15d') for _ in range(account_num)],
                     "account_status":np.random.choice(['Active','Inactive','Suspended'], account_num)})

In [10]:
account['activity_status']=np.where(account['account_status']=='Active', date.today(), 
                                   [fake.date_between(start_date=signup, end_date='-1m') for signup in account['signup_date']])
account=account.drop_duplicates(subset=['user_id','account_type']).reset_index(drop=True)

In [11]:
account

,account_id,user_id,account_balance,account_type,signup_date,account_status,activity_status
0,1,374,620.11,checking,2024-09-19,Active,2024-10-16
1,2,133,921.00,checking,2023-02-02,Inactive,2024-09-24
2,3,301,995.08,checking,2023-04-22,Inactive,2023-12-06
3,4,449,864.32,savings,2022-11-03,Suspended,2023-05-04
4,5,357,924.65,loan,2024-02-04,Suspended,2024-06-20
...,...,...,...,...,...,...,...
608,793,181,533.39,savings,2023-09-14,Inactive,2024-08-14
609,795,428,624.13,savings,2024-06-01,Active,2024-10-16
610,796,310,719.17,checking,2024-08-19,Inactive,2024-09-14
611,799,69,524.06,savings,2023-05-03,Inactive,2024-03-27
612,800,420,580.15,loan,2023-01-28,Suspended,2023-05-21

In [12]:
# checking for duplicates
account[account.duplicated()]

Empty DataFrame
Columns: [account_id, user_id, account_balance, account_type, signup_date, account_status, activity_status]
Index: []

In [13]:
# checking datatypes
account.dtypes

account_id           int32
user_id              int32
account_balance    float64
account_type        object
signup_date         object
account_status      object
activity_status     object
dtype: object

In [14]:
# converting datatypes
account[['signup_date', 'activity_status']]=account[['signup_date', 'activity_status']].astype('datetime64[ns]')

In [15]:
# confirming datatypes
account.dtypes

account_id                  int32
user_id                     int32
account_balance           float64
account_type               object
signup_date        datetime64[ns]
account_status             object
activity_status    datetime64[ns]
dtype: object

In [16]:
# checking for null values
account.isnull().sum()

account_id         0
user_id            0
account_balance    0
account_type       0
signup_date        0
account_status     0
activity_status    0
dtype: int64

In [17]:
# creating the transaction table
warnings.filterwarnings('ignore')
np.random.seed(42)
fake.seed_instance(42)
sign_date = account.set_index('user_id')['signup_date'].to_dict()
account['signup_date'] = pd.to_datetime(account['signup_date'])
account['activity_status'] = pd.to_datetime(account['activity_status'])
transaction=pd.DataFrame({"transaction_id":np.arange(1,transactions+1),
                          "account_id": np.random.choice(account["account_id"], size=transactions, replace=True),
                         "amount":np.round(np.random.uniform(10,1000, size=transactions), 2),
                         "transaction_type":np.random.choice(["Deposit","Withdrawal","Transfer","Online payment"], transactions),
                         "transaction_status":np.random.choice(["Successful","Failed"], transactions)})
transaction = transaction.merge(account[['account_id', 'user_id', 'account_type', 'signup_date', 'activity_status']], 
                                on='account_id', how='left')

transaction['transaction_date'] = transaction.apply(lambda row: fake.date_time_between(
    start_date=row['signup_date'], end_date=row['activity_status']
), axis=1)

In [18]:
transaction

,transaction_id,account_id,amount,transaction_type,transaction_status,user_id,account_type,signup_date,activity_status,transaction_date
0,1,108,139.04,Transfer,Successful,6,checking,2024-06-13,2024-08-22,2024-08-14 01:58:20
1,2,521,316.18,Online payment,Successful,242,loan,2024-05-11,2024-08-22,2024-06-01 14:50:25
2,3,306,125.71,Transfer,Successful,247,checking,2024-08-01,2024-09-10,2024-08-02 05:08:22
3,4,112,986.00,Transfer,Successful,327,checking,2023-03-17,2023-12-26,2023-07-01 19:27:32
4,5,75,315.55,Deposit,Successful,146,loan,2023-11-13,2023-12-07,2023-11-18 22:39:35
...,...,...,...,...,...,...,...,...,...,...
9995,9996,231,963.16,Online payment,Failed,228,checking,2022-11-10,2024-09-11,2023-05-20 07:39:53
9996,9997,139,575.55,Transfer,Failed,22,loan,2024-03-01,2024-10-16,2024-10-02 10:14:53
9997,9998,791,94.32,Withdrawal,Failed,246,savings,2023-10-24,2024-04-12,2024-02-27 12:26:50
9998,9999,26,601.42,Deposit,Successful,368,checking,2023-09-14,2024-03-08,2024-02-13 11:21:48
9999,10000,548,689.72,Withdrawal,Successful,95,checking,2024-01-03,2024-06-17,2024-01-27 09:12:17

In [19]:
transaction=transaction[['transaction_id','user_id','account_id','amount','transaction_type','transaction_status','account_type','transaction_date']]

In [20]:
transaction

,transaction_id,user_id,account_id,amount,transaction_type,transaction_status,account_type,transaction_date
0,1,6,108,139.04,Transfer,Successful,checking,2024-08-14 01:58:20
1,2,242,521,316.18,Online payment,Successful,loan,2024-06-01 14:50:25
2,3,247,306,125.71,Transfer,Successful,checking,2024-08-02 05:08:22
3,4,327,112,986.00,Transfer,Successful,checking,2023-07-01 19:27:32
4,5,146,75,315.55,Deposit,Successful,loan,2023-11-18 22:39:35
...,...,...,...,...,...,...,...,...
9995,9996,228,231,963.16,Online payment,Failed,checking,2023-05-20 07:39:53
9996,9997,22,139,575.55,Transfer,Failed,loan,2024-10-02 10:14:53
9997,9998,246,791,94.32,Withdrawal,Failed,savings,2024-02-27 12:26:50
9998,9999,368,26,601.42,Deposit,Successful,checking,2024-02-13 11:21:48
9999,10000,95,548,689.72,Withdrawal,Successful,checking,2024-01-27 09:12:17

In [21]:
# checking for null values
transaction.isnull().sum()

transaction_id        0
user_id               0
account_id            0
amount                0
transaction_type      0
transaction_status    0
account_type          0
transaction_date      0
dtype: int64

In [22]:
# checking datatypes
transaction.dtypes

transaction_id                 int32
user_id                        int32
account_id                     int32
amount                       float64
transaction_type              object
transaction_status            object
account_type                  object
transaction_date      datetime64[ns]
dtype: object

In [23]:
# checking duplicates
transaction[transaction.duplicated]

Empty DataFrame
Columns: [transaction_id, user_id, account_id, amount, transaction_type, transaction_status, account_type, transaction_date]
Index: []

In [24]:
# creating fraud table
np.random.seed(42)
Faker.seed(22)
samples= transaction.sample(n=1000)
fraud=pd.DataFrame({"fraud_id": np.arange(1,1000+1),
                   "user_id":samples['user_id'].values,
                   "transaction_id":samples['transaction_id'].values,
                   "alert_date":samples['transaction_date'].values,
                   "alert_reason":np.where(samples['transaction_status']=='Successful', 'Suspicious activity', np.random.choice(['Insufficient balance', 'Exceeded daily limits'], size=1000))})
fraud

,fraud_id,user_id,transaction_id,alert_date,alert_reason
0,1,248,6253,2024-07-30 16:24:23,Suspicious activity
1,2,130,4685,2023-09-13 15:52:57,Exceeded daily limits
2,3,424,1732,2023-01-17 17:52:33,Exceeded daily limits
3,4,482,4743,2024-06-20 20:21:44,Suspicious activity
4,5,122,4522,2023-12-27 03:52:27,Exceeded daily limits
...,...,...,...,...,...
995,996,496,3922,2023-09-05 06:58:41,Exceeded daily limits
996,997,82,6686,2023-02-18 15:27:02,Suspicious activity
997,998,443,3195,2024-07-01 18:11:29,Exceeded daily limits
998,999,49,1942,2024-07-27 03:36:15,Suspicious activity
999,1000,7,7714,2023-12-20 14:49:03,Suspicious activity

In [25]:
fraud['alert_reason'].value_counts()

alert_reason
Suspicious activity      499
Insufficient balance     279
Exceeded daily limits    222
Name: count, dtype: int64

In [26]:
# checking for null values
fraud.isnull().sum()

fraud_id          0
user_id           0
transaction_id    0
alert_date        0
alert_reason      0
dtype: int64

In [27]:
# checking for duplicates
fraud[fraud.duplicated()]

Empty DataFrame
Columns: [fraud_id, user_id, transaction_id, alert_date, alert_reason]
Index: []

In [28]:
# checking for datatypes
fraud.dtypes

fraud_id                   int32
user_id                    int32
transaction_id             int32
alert_date        datetime64[ns]
alert_reason              object
dtype: object

In [29]:
# connecting to sql server
project=connect(user='root',host='localhost',password='Adedolapo11@')
cursor=project.cursor()

In [30]:
# creating a database
cursor.execute('DROP DATABASE IF EXISTS portfolio')
cursor.execute('CREATE DATABASE portfolio')
project.commit()

In [31]:
connection=connect(user='root', host='localhost', password='Adedolapo11@', database='portfolio')
engine=create_engine('mysql+pymysql://root:Adedolapo11%40@localhost/portfolio')

In [32]:
# exporting data to database
account.to_sql(name='account', con=engine, if_exists='replace', index=False)

613

In [33]:
# exporting data to database
user.to_sql(name='user', con=engine, if_exists='replace', index=False)
transaction.to_sql(name='transaction', con=engine, if_exists='replace', index=False)
fraud.to_sql(name='fraud', con=engine, if_exists='replace', index=False)

1000